In [1]:
import pandas as pd
import numpy as np

In [38]:
# Basic data frame for operations

df = pd.DataFrame({'Col1':[1,2,3,4], 'Col2':[444,555,666,444], 'Col3':['abc', 'def', 'ghi', 'xyz']})

df.head()

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Unique Value Counts

In [39]:
# Method 1 -- Array met de unieke values
df['Col2'].unique()

array([444, 555, 666], dtype=int64)

In [40]:
# Method 2 -- Count van de unieke values door de lengte van de array
len(df['Col2'].unique())

3

In [41]:
# Method 3 -- Numpy Count van de unieke values
df['Col2'].nunique()

3

# Value Counts

In [42]:
# aantallen per value in een colom
df['Col2'].value_counts()

444    2
555    1
666    1
Name: Col2, dtype: int64

# Subset Colom

In [43]:
# Select a single collumn naar list 
df['Col1']

0    1
1    2
2    3
3    4
Name: Col1, dtype: int64

In [44]:
# Selecteer mneerdere colommen (list in een list)
df[['Col1', 'Col2']]

   Col1  Col2
0     1   444
1     2   555
2     3   666
3     4   444

In [13]:
# return all coloms op basis van conditie in bepaalde colom
df[df['Col1']>2]

   Col1  Col2 Col3
2     3   666  ghi
3     4   444  xyz

In [14]:
# combineren van condities en return all coloms op basis van conditie in bepaalde colomen
df[(df['Col1']>2) & (df['Col2']==444)]

   Col1  Col2 Col3
3     4   444  xyz

# Subset Rows

In [47]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [50]:
#Method 1 (loc) voor locatie
df.loc[2] # index

Col1      3
Col2    666
Col3    ghi
Name: 2, dtype: object

In [51]:
# Methode 2 de Iloc (integer location) is het colom getal in de rij
df.iloc[2] # het getal van de row

Col1      3
Col2    666
Col3    ghi
Name: 2, dtype: object

# Subset Row & Column

In [53]:
df.loc[2, 'Col2'] # naam van de index row en de colomn

666

# Apply functie op een colom in de data set

In [15]:
def times2(x):
    return x*2

In [16]:
df['Col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: Col1, dtype: int64

In [18]:
# de lengte van alle strings
df['Col3'].apply(len)

0    3
1    3
2    3
3    3
Name: Col3, dtype: int64

In [19]:
# Lambda expresiie toepassen

df['Col3'].apply(lambda x: x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: Col3, dtype: object

# Remove Coloms

In [25]:
df.drop('Col1', axis=1) #Inplace = True voor in de frame zelf

   Col2 Col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [27]:
# Collom namen in een list
df.columns

Index(['Col1', 'Col2', 'Col3'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Remove Rows

In [45]:
df.drop(2, axis= 0) # op basis van de index

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
3     4   444  xyz

# Sorteren en Orderen van een DF

In [29]:
df

   Col1  Col2 Col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
#sorteren van colom zonder de index te wijzigen
df.sort_values(by = 'Col2')

   Col1  Col2 Col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Pivot Table

In [34]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', ' bar'],
        'B':['one', 'one', 'two', 'two','one', 'one'],
       'C':['x', 'y','x', 'y','x', 'y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [35]:
df

      A    B  C  D
0   foo  one  x  1
1   foo  one  y  3
2   foo  two  x  2
3   bar  two  y  5
4   bar  one  x  4
5   bar  one  y  1

In [36]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C           x    y
A    B
 bar one  NaN  1.0
bar  one  4.0  NaN
     two  NaN  5.0
foo  one  1.0  3.0
     two  2.0  NaN

# GROUPBY

In [55]:
# Aggregate values by een colomn
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Charlie', 'Amy', 'Vanesse', 'Carl', 'Sarah'],
        'Sales'  : [200,120,340,124,243,350]}

df = pd.DataFrame(data)

In [57]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanesse    124
4      FB     Carl    243
5      FB    Sarah    350

In [67]:
by_com = df.groupby('Company')

In [69]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64